const express = require('express');
const line = require('@line/bot-sdk');

const app = express();
 
const config = {
  channelAccessToken: process.env.CHANNEL_ACCESS_TOKEN,
  channelSecret: process.env.CHANNEL_SECRET
};

const client = new line.Client(config);

app.post('/webhook', line.middleware(config), async (req, res) => {
  const events = req.body.events;

  for (let event of events) {

    if (event.type === 'message' && event.message.type === 'text') {

      const userText = event.message.text
        .toLowerCase()
        .trim()
        .replace(/\s+/g, "");

      let replyList = null;

      // 🔥 คิดถึง (จับได้หลายแบบ)
      const missYouRegex = /(คถ)|(คิดถึง+)|(คิดถุง)|(คิดทึง)/;

      if (missYouRegex.test(userText)) {
        replyList = [
          "คิดถึงเหมือนกานนนน 💕",
          "ไม่ว่างตอบ พุ่งหลังอยู่ 🫠 แต่่เค้าคิดถึงเทอทุกวินาทีเลยแหละ ิิ ",
          "เค้าก้ออคิดถึงงง เด่วเค้าจะรีบกลับไปหาา รออีกแปปนึงนะ🥺 ",
          "เค้าคิดถึงเทอมากกว่าอีก มากกว่าล้านๆๆๆๆ เท่าเลยย💯 ",
          "คิดถึงแฟนนะคะ",
          "คิดถึงจิงมั้ย จิงอะป่าว จิงมั้ยน้าาาา เชื่อก้อด้าย ",
          "คิดถึงจนอยากทะลุจอไปกอดเลยนะ 🥺",
          "คิดถึงที่รักที่สุดเหมือนกัน ",
          "ที่ร้าาก คิดถึง คิดถึง คิดถึง ",
          "คิดถึงออนซ์จังงงง "
        ];
      }

      // 🔥 ฝันดี
      else if (/ฝันดี+|(หลับม่ายฝัน)|(หลับไม่ฝัน)|(ง่วง)/.test(userText)) {
        replyList = [
          "หลับม่ายฝันน้าาา 🌙",
          "พักผ่อนหน่อยมั้ยย นอนอนอนอนอน",
          "อยากไปนอนข้างๆให้เทอหายเหนื่อย",
          "ให้ไปนอนกอดมั้ย อยากวาร์ปปออกไปหาเทอ ",
          "โอ๋ๆๆ พักผ่อนด้ายแล้ว พักให้หายเหนื่อย"
        ];
      }
      
      else if(/(หิว)|(อยากกิน)|(กิน)|(ข้าว)|(หม่าล่า)/.test(userText)) {
        replyList = [
          "ได้อารายกินนน อร่อยมั้ยย",
          "มีอารายกินมั้ยย",
          "อย่าลืมหาอะไรกินด้วยจะได้มีแรงนะ",
          "กินซะ ไม่กินจะหิวโซ มัวแต่ทำสิ่งนั้น มัวแต่ทำสิ่งนี้ ไม่หยุดทำสักที เด่วก้อมีโรคประจำตัว",
          "กินกินกินกิน กินให้อาหร่อยยย กินเยอะๆๆเผื่อเค้าด้วยย",
          "เด่วกลับไปจะพาไปกินอารายหร่อยๆๆๆๆๆๆ" 
        ];
      }
     
      else if(/(จุ้บ)|(หอม)|(จูบ)|(จุ๊บบ)|(จุ้บๆ)/.test(userText)) {
        replyList = [
          "ิิ น่ารักกกก",
          "ขอจุ้บอีกกกก น้าาา ิิ",
          "มาจุ้บเลยยยยย "
        ];
      }

      else if(/(กอด)|(ซบ)|(อิง)|(พิง)|(กอดด)/.test(userText)) {
        replyList = [
          "มากอดดด โอ๋ๆๆ",
          "คนเก่งมากอดมาา",
          "กอดกอดกอด รักนะ อยากกลับไปกอดตัวจริงแล้ว"
        ];
      }
      else if(/(เหนื่อย)|(นอย)|(ท้อ)|(เสียใจ)|(เสียจัย)|(เครียด)/.test(userText)) {
        replyList = [
          "เปนอารายเล่ามาาด้ายนะ อาจจะตัวไม่อยู่แต่ใจอยู่แน่นอนน",
          "ไหวมั้ย ต้องอดทนหน่อยนะ ทุกอย่างที่เข้ามาในชีวิตเปนบดทดสอบ",
          "เทอเก่งอยู่แล้ว เค้าเชื่อมั่นว่าเทอจะต้องผ่านมันไปได้แน่่่่ สู้สู้",
          "สู้มั้ย ต้องสู้นะ เพื่อตัวเทอเอง เค้าเปนกำลังใจให้เทอด้ายเสมออยู่แล้ว รักนะ",
          "กำลังใจอยู่ตรงนี้นะที่รัก",
          "เชื่อมั่นในตัวเองนะ ทุกอย่างจะผ่านไปด้ายด้วยดี",
          "โอ๋ๆๆ มปรนะ มากอดมา ",
          "ชีวิตต้องไปต่อนะ อย่ายอมแพ้ "
        ];
      }
     
      else if(/(ตื่น)|(สลบ)|(ขี้เกียจ)|(ยม)|(อ่อม)/.test(userText)) {
        replyList = [
          "ลุกขี้นไปล้างหน้าล้างตาาา",
          "ตื่นตื่นตื่นตื่น ลุกจากเตียง",
          "ออกมายืดเส้นยืดสายสักหน่อย",
          "อ่ยยยยย เอนดู โอ๋ๆ"
        ];
      }

      // 🔥 กินอะไร
      else if (/(รัก)|(ร้าก)|(รักนะ)|(ร้าากก)|(รุก)/.test(userText)) {
        replyList = [
          "รักนะคะที่ร้าก",
          "เค้าก้อรักเทอ รักที่สุด ที่สุ้้ดดดด",
          "รักมากกกกก รักทุ้กกวันนน รักตลอดเวลาา",
          "เค้ารักเทอมากกว่าอีกก ิิ ",
          "รักตลอดเลยนะ ",
          "รักจิงม้ายยยย รักเท่าเค้าอะป่าววว",
          "รักแฟนครับ ไม่อยากให้ใครมายุ่ง หวง ",
          "เค้าก้อรัก เพราะฉะนั้นต้องดูแลตัวเองด้วยนะ ถ้าเปนอะรายมาเค้าโกดแน่น่น่น !!",
          "1 2 3 4 5 เค้าเลิฟเทอ ",
          "รักนะค่ะเจ้าออนซ์ ",
          "รัก รัก รัก รัก รัก  ",
          "รักนะออนซ์",
          "ขอจุ้บบหน่อยย",
          "มาจุ้บมาที่รักกก"
        ];
      }

      // 🔥 ถ้าไม่ตรงอะไรเลย
      else {
        replyList = [
          "ม่ายด้ายตั้งค่าไว้ฮือออ",
          "คิดถึง",
          "พูดอีกทีได้ไหม 🥺", 
          "มาจุ้บมา"
        ];  
      }

      const randomReply =
        replyList[Math.floor(Math.random() * replyList.length)];

      await client.replyMessage(event.replyToken, {
        type: 'text',
        text: randomReply
      });
    }
  }

  res.sendStatus(200);
});

app.listen(3000, () => {
  console.log('Server is running on port 3000');
});
